content-org/posts.org
:PROPERTIES:
:ID:       76FF95B7-7784-418B-9B46-5126F6B69BA2
:END:
#+title: Random Geekery Life
#+author: Brian Wisti
#+hugo_custom_front_matter: :formatter "ox-hugo"
#+hugo_base_dir: ../
#+startup: logdone

***** DONE [2022-05-02 Mon 14:56]                                 :emacs:
CLOSED: [2022-05-02 Mon 15:00]
:properties:
:export_file_name: 1456.md
:ID:       7383F674-3075-48A2-8301-D3C655711C20
:end:
:LOGBOOK:
- State "DONE"       from              [2022-05-02 Mon 15:00]
:END:
Note added with a capture template, though I still need to manually assemble a bit.

#+begin_src elisp
  (setq org-capture-templates
        '(("t" "Tumblelog" entry
           (file+olp+datetree bmw/tumble-log)
           "* %U %?\n:properties:\n:export_file_name: nnn.md\n:end:\n")
          ))
#+end_src

Less manual construction than a couple minutes ago!

I'll have to learn some Elisp to make it work how it does in my head.
